---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternalDefinitionCreationOptions
source: html/4f72c8f8-fac6-4251-7abf-74cea953022f.htm
---
# ExternalDefinitionCreationOptions Members

Constructs the options using a specified name and type.